{"Books/Atomic-Habits":{"title":"Atomic Habits","links":["Zettelkasten/Make-bad-habits-harder"],"tags":[],"content":"I’ve listen to it using Audible. Liked it, but didn’t put much in practice… 😬\nWell, if I have to choose, these are the main bits that I tend to remind myself\n\nNew habits must be easy, like leave your running clothes ready or try 2 minutes of exercise\n\nI did try multiple times, but still missing more commitment. Hard to cross the 2 weeks threshold. 😬\n\n\nMake bad habits harder\n"},"Contexts/Camping/My-camping-kitchen":{"title":"My camping kitchen","links":[],"tags":["diy","camping"],"content":"\n\nConstraints\n\nDrawers, easy to pick stuff up\nQuick use table\nEasy storage for extra food\n\n\n\n add pictures about camping kitchen and how it’s going\n\n\nChecklist\n- Paper towel\n- Cutllery\n- Pots and pans\n- Gas Cooker\n- Gas bottle\n- Cutting table\n- Water\n- Dish washing\n- Fridge\n- Lights\n"},"Contexts/Camping/My-stretcher-tent":{"title":"My stretcher tent","links":["Contexts/Maintenance/Mahindra-Pik-Up-2019"],"tags":["camping"],"content":"I found it easy to setup, easy to pack down and really comfortable. It works really well for me. I’ve slept on it with my 6 years old kid with no problems as well.\nI use this when going by myself on mental health recharging trips. It’s part of my Mahindra Pik Up 2019 camping setup.\nIt’s an Easy fold stretcher tent from OZTrail.\n\n"},"Contexts/DIY/HotWheels-Firepit---My-first-welding-project":{"title":"HotWheels Firepit - My first welding project","links":[],"tags":["diy","welding","camping"],"content":"This is a simple project to start with, and it’s quite cool.\nI’ve built this as a project part of a welding course that I did on WELTEC.\nI didn’t use it much at the end, it ended up all rusty and I threw it away. But I was bloody proud of it for quite a while.\n\n\nIt’s simple:\n\nyou find two steel wheels,\nweld them together,\ncut a piece to make the door,\nmake a hinge\nsome metal legs\ndone\n\nOpen Album\n"},"Contexts/Maintenance/Mahindra-Pik-Up-2019":{"title":"Mahindra Pik Up 2019","links":["Contexts/Camping/My-stretcher-tent","Contexts/Maintenance/Where-to--find-spare-parts-Mahindra-Pik-Up-in-New-Zealand","Contexts/Camping/My-camping-kitchen","Projects/Done/Install-winch-behind-original-bumper","tags/someday"],"tags":["cars","diy","mahindra","someday"],"content":"Dec/2023 I fell in love with a Mahindra Pik Up and bought it. Here I’m going to share some of the things that I did on it. Her name is Mariana, given by my wife Vanessa.\n\nMariana is a tourer, capable enough off-roader, and camper. You don’t sleep in it, it has the kitchen always ready and I can either get My stretcher tent if by myself or my Pop top caravan if with family.\nUseful topics\n\nWhere to  find spare parts Mahindra Pik Up in New Zealand\n\nProjects\nDone\n\nMy camping kitchen\n\n\nInstall winch behind original bumper\n\n\nUTE flatdeck with tool box\n Electrical - Auxiliar battery, solar\n New android unit with 360 cameras\n\n\n Changing wheel bearings\n\n\n Changing tie rod\n\nTODO\n\n  Onboard air compressor with an air tanksomeday\n\nWorkshop Manual (not for my model, but useful)\n"},"Contexts/Maintenance/Where-to--find-spare-parts-Mahindra-Pik-Up-in-New-Zealand":{"title":"Where to  find spare parts Mahindra Pik Up in New Zealand","links":["Contexts/Maintenance/Mahindra-Pik-Up-2019"],"tags":["diy","cars"],"content":"Sourcing parts\nI live in New Zealand, and Mahindra is not really popular down here.\nThere are no parts on our main sources like Repco, Supercheap Auto, or BNT. So your only option is to find alternatives that would fit, or to get in touch with a Mahindra Dealer.\nAlso try the Facebook group Mahindra owners club Australia, people are friendly and helpful.\nNew Zealand\nNo parts on Repco or Supercheap. You need to rely on a dealer to order your parts directly from Mahindra.\nMahindra NZ will send the parts to you, not the dealer, they usually have no stock.\nBe aware to double check as sometimes the part can be out of stock.\nTheir prices will vary a bit, bellow you can check a comparison between some dealers.\nNorthland Mahindra ⭐\nwww.northlandmahindra.nz/contacts/\nTalk to Nigel, friendly, best price and great service!\n0800 120 236\nShortland Auto Co - Rotorua\nwww.shorlandautoco.co.nz/parts/\n07 348 3179\nTalk to Liam\nFagan Motors\n www.faganmotors.nz/parts/\n 0800 500 051\nI don’t remember who I have talked to, but they felt more knowledgeable about the required parts when asking bout changing my bearings.\nPrice comparison (quoted on Nov/2024)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPartFarganNorthlandKepplerShortlandFront Right Disc rotor$278$241.15$273.00Right front wheel bearing inner$122$106.10$125.00Right front wheel bearing outer$90$68.40$98.00Front Inner seal$39.50$34.30$83.25Front Outer seal$79.32-$39.00Brake Pads - set$264$229.10$275.00Inner tie rod?$103.60?$115Outer tie rod?$73.60?$115\nNorthland Mahindra had the best prices, and Nigel is awesome to deal with. So I’m sticking with him from now on.\nAustralia\nAustralia seems to have a better range of parts, and the freight is similar. It would take from 2-7 days, a bit longer than if you order in NZ.\nFor example, the left inner tie rod was not available in NZ, it would take around up to 6 weeks to arrive (unbelievable). From  source in AU I was able to get the whole kit including inner/outer tie rods for both sides for $260 AUD.\nSo, if you can’t find parts in NZ, try AU.\nIndia\n\nPartsBigBoss - Got in touch with them via WhatsApp, but they do not seem to ship internationally\n"},"Contexts/Paloma/Build-trust-by-communicating-often":{"title":"Build trust by communicating often","links":[],"tags":[],"content":"prensentation\nThe problem:\nYou are craving for a bagel from the airport and decide to hire someone to bring that to you.\nThe solution:\nHire a driver to deliver this package\nWe hire someone\nThe driver comes, they charge $100 per hour and estimates that it will take 1 hour to pick this package up, but it could take longer.\n\nThey come 6 hours later, with a bitten bagel inside of a safe box saying sorry that it took way longer than they estimated and a bill of $500.\n\nHow would you feel? Would you hire this company again? Do you trust them? Would you even consider paying for that bill?\nLet’s go back in time, and try again!\nThe driver comes, they charge $100 per hour and estimates that it will take 1 hour to pick this bagel up, but it could take longer.\nBefore going, they explain that they will keep you updated and will need you to check your messages in case of something unexpected happens.\nOff they go, and you receive a message 10 minutes later:\n\n“We have a flat tyre, we are going to take at least 10 minutes to fix it. We will keep you posted”\n\n20 minutes later:\n\n“Flat tyre fixed, on our way to the airport”\n\n30 minutes later:\n\n“There was an explosion on the highway and everything is blocked, they are estimating at least 10 hours to release traffic. I know an alternative route, it’s a bit risky, but given the importance of your bagel I believe it worth a shot. It can take from 5 to 10 hours. Should I go?”\n\nYou think how much you need those bagels to be able to start your day and say YES! Go for it.\n1 hour later you receive:\n\n“The road is better than expected, and we are having good progress”\n\n1 hour  later:\n\n“We found some bumps along the way, but managed to go over it with success! We may find more challenges but we still on track. Everyone is really excited with your Bagel, it’s becoming a reality.”\n\n1 hour  later:\n\n“More bumps along the way, but good progress so far”\n\n30 minutes later:\n\n“We can see the airport!”\n\n30 minutes later:\n\n“Buying your bagel, there are at least 60 people in front of us, everyone is hungry while waiting for the highway to open up again”\n\n30 minutes later:\n\n“We’ve got it!!! On our way back”\n\n1 hour later:\n\n“The highway still closed, everyone is hungry and looking at your bagel, we are protecting it with our lives! We already know the alternative route works, we believe we can be back in around 3 hours if we take it. Should we wait or go for the alternative route?”\n\nYou are hungry as well, and tell them to go for the alternative route, you know they managed to to it before\n1 hour later:\n\n“There’s a mob of hungry drivers on our route, they managed to bite your bagel! I’m so sorry we did everything we could to keep it safe. We can go back and buy another one, or  keep going your way, it is not looking that bad and it still fresh. Going back could add around 5 hours to the journey”\n\nYou think about the budget and realise that a bitten bagel earlier is better than a full one later. And your budget is really tight now. You ask them to keep coming without buying a new bagel.\n1 hour later:\n\n“We are on our way back. We took the liberty of adding your bagel to a safe box, it was $50 bucks, but it already paid itself out as we found 3 more mobs of hungry drivers.”\n\n1 hour later:\n\n“We still on our way, everything is going as expected”\n\n10 minutes later:\n\n“We arrived! This is your bagel, and your safe box. It was a great journey and the team is proud to be able to help you out. It took us around 10 hours and this is your bill.”\n\nYou know what you paying for… It’s way more than your initial budget. Would you hire them again? I would!"},"Projects/Done/Install-winch-behind-original-bumper":{"title":"Install winch behind original bumper","links":["Contexts/Maintenance/Mahindra-Pik-Up-2019"],"tags":["diy","off-roading","mahindra"],"content":"Using scrap metal from a scrapyard and some welding. I’ve built a custom winch cradle and installed a winch in my Mahindra.\nJust some pictures for now…\n\n\n[Open Album](photoprism.jose.co.nz/library/albums/asnvx60luaz7kbo6/view)"},"Software-Engineer/A-bad-decision-is-better-than-no-decision":{"title":"A bad decision is better than no decision","links":["Software-Engineer/Tips-for-Software-Engineers","Felipe-Schnack"],"tags":["software-development"],"content":"Part of Tips for Software Engineers\nWhen stuck thinking about a problem just do stuff. Felipe Schnack once told me “A bad decision is better than no decision”.\nThis is not not true in many cases, a bad decision can be catastrophic but works to unlock yourself and allow yourself to fail faster! So just take the bad decision to see what happens when coding. And keep going."},"Software-Engineer/Approach-with-curiosity":{"title":"Approach with curiosity","links":["Software-Engineer/Code-review-pyramid","Software-Engineer/Tips-for-Software-Engineers"],"tags":["software-development"],"content":"When someone does something in a way that you do not agree, approach with curiosity, you may be able to learn something today!\n\nask why things are done in certain way\n\n3 questions, then you understand their point of view\n\n\nonly after understanding their point of view, present your own\n\nRelated to Code review pyramid\nPart of Tips for Software Engineers"},"Software-Engineer/Broken-changes-can-be-compared-to-previous-working-version":{"title":"Broken changes can be compared to previous working version","links":["Software-Engineer/Tips-for-Software-Engineers"],"tags":["software-development"],"content":"Tip time: when you start changing something, and it stops working, you can always try the previous version again to look for differences.\n\nyou can inspect the requests sent to the backend (using the browser Network tab, or form the logs or rails log/development.log)\nyou can look for the generated HTML on both versions and try to identify missing fields, different actions, etc.\n\nAlways make sure that the previous version is working as expected, sometimes we start changing something that is already broken and have no working version to compare. (been there)\nTips for Software Engineers"},"Software-Engineer/Building-this-website":{"title":"Building this website","links":["Unraid","tags/someday"],"tags":["someday"],"content":"I use Obsidian to take notes, and I’ve been taking notes for quite a while.\nI thought on sharing more of my projects and decided to grab some of my notes and publish it.\nFor that I’ve found Quartz, which already supports most Obsidian Markdown flavours.\nI followed it’s documentation and changed some bits:\n\nUsed a symlink to my Notes folder and ignored the content folder (I don’t want all my personal notes on Github)\nHave only one folder of attachments that can be moved to public.\n\nAdd &quot;!(PublicMedia)**/!(*.md)&quot;, &quot;!(*.md)&quot; to ignoredPatterns on quartz.config.com\n\n\nAdded the public folder to my git repository, allowing me to build it locally and publish using Github Pages\nAdd a custom domain, and a new DNS record. Done.\n\nTODO\n\n Automate build and deploy, by moving it from my computer to my Unraid serversomeday\n Add integration to a comment systemsomeday\n"},"Software-Engineer/Code-review-pyramid":{"title":"Code review pyramid","links":["Software-Engineer/Tips-for-Software-Engineers"],"tags":["software-development"],"content":"Part of Tips for Software Engineers, the idea is to focus more on the solution and it’s potential problems other than discuss small stylish bits.\n\nWhen it comes to code reviews, it’s a common phenomenon that there is much focus and long-winded discussions around mundane aspects like code formatting and style, whereas important aspects (does the code change do what it is supposed to do, is it performant, is it backwards-compatible for existing clients, and many others) tend to get less attention.\nGunnar Morling\n\n"},"Software-Engineer/Make-it-work,-then-make-it-better":{"title":"Make it work, then make it better","links":["Software-Engineer/Tips-for-Software-Engineers"],"tags":["software-development"],"content":"To avoid Paralysis Analysis, what helps me move along is do it dirty first, make it work, learn as much as you can at this stage, then commit to an idea.\nI find that when I make it work, it becomes easier to organise a plan to tackle the actual implementation, and most of the times the “dirty” implementation is more than enough for solving the current task at hand.\nTips for Software Engineers"},"Software-Engineer/Tell-don't-ask":{"title":"Tell don't ask","links":["Software-Engineer/Your-method-is-telling-a-story","Software-Engineer/Tips-for-Software-Engineers"],"tags":["software-development"],"content":"Tell don’t ask\nThis is a “rule of thumb” to improve abstractions while coding. Instead of asking to another domain what is their state to execute something, you just say “please, execute this when it makes sense to do so”\nAvoid:\ndef complete_invoice\n  invoice.due_date = Date.today\n  ...\n  if invoice.ready_to_be_sent\n    InvoiceSender.send(invoice)\n  end\nend\nBetter:\ndef complete_invoice\n  invoice.due_date = Date.today\n  InvoiceSender.send_ready_invoice(invoice)\nend\n \nclass InvoiceSender\n  def send_ready_invoice(invoice)\n      return unless invoice.ready_to_be_sent\n      InvoiceSender.send(invoice)\n  end\nend\n \nWe could abstract it even further, and trigger the InvoiceSender at any moment to send invoices that are ready.\nWhy?\nI believe it helps keeping the code easier to follow and to ready, each if breaks the flow and makes you stop and think about that, it’s not like reading a book. And if there are complex conditions, it becomes even harder. When you ‘tell don’t ask”, you can read your code closer to the way you read a book. Your method is telling a story.\nThis is part of Tips for Software Engineers"},"Software-Engineer/Tips-for-Software-Engineers":{"title":"Tips for Software Engineers","links":[],"tags":["software-development"],"content":"Tips for Software Engineers\nLike myself 😅"},"Software-Engineer/Vertical-Slicing":{"title":"Vertical Slicing","links":["Software-Engineer/Tips-for-Software-Engineers"],"tags":["software-development"],"content":"Let’s start with some Principles behind the Agile Manifesto:\n\nOur highest priority is to satisfy the customer  through early and continuous delivery  of valuable software.\n\n\nDeliver working software frequently\nSimplicity—the art of maximizing the amount  of work not done—is essential\n\nWhat is a vertical slice?\n\nA vertical slice means a bit of every layer. Again as an example, a new feature request like “showing x information on main screen” would contain these work bits:\n\nWork in the UX/UI that will display the information\nWork in the service layer to transform the information\nWork in the database layer to store / fetch the information.\nWikipedia\n\n\nI like the analogy with a cake from this post.\n\nPeople don’t eat layers of a cake. We don’t eat all the top layer before we start eating the second layer – we cut the cake into slices (thin or thick, depending on your preference and diet) and then eat those. Again, looking at the cake as the whole product,\n\nUser stories come to play\nOne way to try achieving a vertical slice is by focusing the stories on the end user.\nThat’s why we call a feature “user story”, and it is common to follow the format “As a user, I can update Client”. This format reminds us that the goal is to deliver valuable software to the end user. When that’s too big, the goal is to find the sweet spot by reducing the scope in all layers. For example, we could reduce the scope by changing the story to “As a user, I can update the title of a Client”.\nBut I don’t know frontend…\nIt is tempting and natural for engineers to split within layers. That is logically easier. It is more comfortable to pick a backend task up if you know the backend. But remember, you are part of a team, and your team should be able to deliver a task touching all the layers at once. More than one person can be working in the same task at once, getting in sync and focusing on delivering the piece of the cake together. You, as a team player, can still work on what you work best, but everyone can be focused on delivering that piece of cake, or even a cupcake if that allows you to get more insights and deliver more value at this iteration.\nBe ready to change\nThis idea, to be implemented, will likely require your team to change their ways of working, trying new ways to deliver value. You are not do it right in the first iteration… Keep moving, keep reviewing and trying other ways to deliver value faster.\n\nJust a reminder that all of these are guidelines, not rules. They are analogies to help us deliver value faster, which does not apply to all cases. For example, it is common to have to do work beforehand to deliver value easier later. You will have to sharpen your saw from time to time.\n\nPart of Tips for Software Engineers"},"Software-Engineer/When-stuck,-ask-for-help-ASAP":{"title":"When stuck, ask for help ASAP","links":["Software-Engineer/Tips-for-Software-Engineers"],"tags":["software-development"],"content":"When stuck, ask for help ASAP\nIf you get stuck in to a problem, ask for help as soon as possible. As a rule of thumb, 30 minutes is good, more than 1 hour is probably to long.\nYou don’t need to even talk to anyone, you can try formulating your question and that is likely to help you finding an answer to your question. So, if it’s taking too long, stop and ask for help.\nThis is part of Tips for Software Engineers\nThis post from Daniel Roy Greenfeld reminded me of this rule."},"Software-Engineer/Your-method-is-telling-a-story":{"title":"Your method is telling a story","links":["Software-Engineer/Tips-for-Software-Engineers"],"tags":["software-development"],"content":"Write your methods in way that is easy to understand what is their purpose, and what you are trying to achieve with that.\n\n add examples\n\nThis is part of Tips for Software Engineers"},"Zettelkasten/Make-bad-habits-harder":{"title":"Make bad habits harder","links":["Books/Atomic-Habits"],"tags":[],"content":"If you want to change/reduce a bad habit, make it a bit harder. For example, if you want to reduce the amount of time watching TV, remove the TV from the room, or at least, remove the batteries of the controller.\nI’ve been doing this to reduce the meaningless browsing while working. I use the leechblock NG chrome extension and block websites like 9gag and facebook for 20 seconds. This is enough to remove the automatic opening of these websites when blocked while working.\nI uninstalled instagram from my phone as well.\nThis advice came from the book Atomic Habits that I’ve listen on Audible\nI feel it works well for me."},"Zettelkasten/Notes-in-only-one-place":{"title":"Notes in only one place","links":["Zettelkasten/Write-it-down-to-solve-it"],"tags":[],"content":"I’ve used Evernote in the past with good success, but it started getting too slow for my liking and I stopped.\nKindly they allow you to migrate all your notes elsewhere.\nAdopting Obsidian\nI need a place to start the Write it down to solve it idea. I see that helps me keep going. And today, I have my notes everywhere… it’s a mess!\nWhere do I keep notes today?\n\nGoogle Keep\nWunderlist\nGoogle Tasks\nNotion (work)\nPaper diary for dumping stressful ideas\nPaper notebooks that I simply throw away later\n\nWhat’s my motivation to try it?\n\nnot sure, heard about it and found it cool. Maybe another tool to keep aleatory things?\nnão sei, ouvi falar e achei legal. Seria mais uma ferramenta com coisas aletórias?\nthe graph view looks cool\nand I’ve got a tip of how to start from a work mate\nthere’s a mobile version obsidian.md/mobile\n\nUpdate Dec/2024: I’ve been using Obsidian extensively, and I love it\nI should probably write about it."},"Zettelkasten/Write-it-down-to-solve-it":{"title":"Write it down to solve it","links":["Zettelkasten/Notes-in-only-one-place"],"tags":[],"content":"Write it down to organise your ideas\nWhen I write something down, it is easier to organize my mind and make things clear. I tend to run in circles, until I start writing it down.\nNot only that, it helps me to release the pressure when I’m feeling down.\nThe plan is to use Obsidian to start writing my notes down and see how it goes. Notes in only one place"},"index":{"title":"José Coelho","links":["my-call-to-keep-the-internet-public","tags/software-development","tags/camping","tags/cars","tags/off-roading"],"tags":["software-development","camping","cars","off-roading"],"content":"Hello\nI’m José Coelho, I’m a father, husband and my passion is tinkering and learning.\nMy professional mission is to bring joy to the ones around me while delivering value.\nI’m currently working as a Staff Software Engineer with Paloma Group.\n\nGitHub\nLinkedIn\n\nWhat is this website?\nI’m a generalist, not only in  the software development, but also in all other areas of life. I like doing different things and learning by doing. This is to share a little bit of human content and follow my call to keep the internet public.\nSome of the things that I like to do, and may share bits about are:\n\nsoftware-development\ncamping\ncars\noff-roading\n"},"my-call-to-keep-the-internet-public":{"title":"my call to keep the internet public","links":["Contexts/Maintenance/Mahindra-Pik-Up-2019","hard-to-know-what-you-don't-know","tags/software-development"],"tags":["internet","knowledge","software-development"],"content":"\nTLDR: What I’m noticing is that it is getting harder and harder to get answers by searching in the internet. Let’s choose public groups and websites over closed groups behind a username and password\n\nMy first car was a VW Beatle 1977. I believe that’s were my “passion” to understand and fix cars started. It actually started because I didn’t have much money and a 30 years old car is likely to fail at some point. 😬\nFor any brand or car imaginable, we would have a public forums with people asking questions and helping each other. It was lovely. “In the olds days… 😆“. I recently bought a Mahindra Pik Up, it’s not the most popular truck in NZ, and it was not straight forward to find help searching online or asking AI.\nWhat is my view?\nAll these forums have now moved to Facebook Groups, WhatsApp groups, LinkedIn or any other social media group. Result, all of that knowledge is now enclosed in a non-public place. All of this knowledge is not searchable. You need to be part of that group to find the knowledge. But, it’s hard to know what you don’t know. So if you don’t know about the groups, you may be left alone in the beach by yourself, singing a song and feeling a bit sad.\nWith the advance of LLMs (AI), things are not getting better. We are now asking the AI, getting good and bad answers, but we are not sharing this interaction with anyone. The result… this knowledge is enclosed behind a a username and password. The LLM that you are using can get better, as they can train themselves based on your interactions, but that’s it. No other LLM will be trained by that chat you had.\nIt’s not all bad, don’t get me wrong. The open public spaces are still here, indexable and with human interactions. A good example is Reddit, you can find any topic there, and it’s public. Result, we are building knowledge together.\nOn thesoftware-development area, we have Stack overflow. If you worked as a software engineer, you used it at some point. Please, keep posting things there (I’m probably talking to myself here), build knowledge for us all, not only for the big tech to train their models and give us answers without a reference.\nThat’s my call… share what you know in a public space. It doesn’t matter if it’s your website, a forum, Medium, X, whatever… just choose something that’s indexable and public."}}